Has something changed in the meantime?

Following the advice [here](https://registry.terraform.io/providers/hashicorp/aws/latest/docs/resources/cloudfront_public_key):

> NOTE: When setting `encoded_key` value, there needs a newline at the end of string. Otherwise, multiple runs of terraform will want to recreate the `aws_cloudfront_public_key` resource.

I have this `storage.tf`:

```tf
locals {
  cloudfront_public_key_private = "${chomp(var.cloudfront_public_key_private)}\n"
}

resource "aws_cloudfront_public_key" "private" {
  comment     = "caribid-private"
  encoded_key = local.cloudfront_public_key_private
  name        = "caribid-private"
}
```

On the first `tofu plan`:

```
  # aws_cloudfront_public_key.private will be created
  + resource "aws_cloudfront_public_key" "private" {
      + caller_reference = (known after apply)
      + comment          = "caribid-private"
      + encoded_key      = <<-EOT
            -----BEGIN PUBLIC KEY-----
            MFkwEwYHKoZIzj0CAQYIKoZIzj0DAQcDQgAEwTjQKzvqfLRB8FWq/7s6m7BUFgeV
            sGsov4uWEibNM7FkaP66jAmJkIMsBkN66xAXUC9bXuIoE6u3pKmDKoGMxg==
            -----END PUBLIC KEY-----
        EOT
      + etag             = (known after apply)
      + id               = (known after apply)
      + name             = "caribid-private"
      + name_prefix      = (known after apply)
    }
```

After `tofu apply`, on the next `tofu plan`:

```
  # aws_cloudfront_public_key.private must be replaced
-/+ resource "aws_cloudfront_public_key" "private" {
      ~ caller_reference = "terraform-20251113174856359100000001" -> (known after apply)
      ~ encoded_key      = <<-EOT # forces replacement
          - -----BEGIN PUBLIC KEY-----
          - MFkwEwYHKoZIzj0CAQYIKoZIzj0DAQcDQgAEwTjQKzvqfLRB8FWq/7s6m7BUFgeV
          - sGsov4uWEibNM7FkaP66jAmJkIMsBkN66xAXUC9bXuIoE6u3pKmDKoGMxg==
          + -----BEGIN PUBLIC KEY-----
          + MFkwEwYHKoZIzj0CAQYIKoZIzj0DAQcDQgAEwTjQKzvqfLRB8FWq/7s6m7BUFgeV
          + sGsov4uWEibNM7FkaP66jAmJkIMsBkN66xAXUC9bXuIoE6u3pKmDKoGMxg==
            -----END PUBLIC KEY-----
        EOT
      ~ etag             = "E23ZP02F085DFQ" -> (known after apply)
      ~ id               = "K2345VJRAYJGRJ" -> (known after apply)
        name             = "caribid-private"
      + name_prefix      = (known after apply)
        # (1 unchanged attribute hidden)
    }
```